bio_sections = {
    "overview": (
        "Пётр I Великий (1672-1725) – российский император\n\n"
        "Перипетии судьбы Петра I (1672–1725), последнего русского царя и первого императора Всероссийского, вот уже три столетия занимают исследователей, политиков и литераторов. Великий реформатор перекроил российское общество, разделив историю страны на «петровскую» и «допетровскую» эпохи, а некоторые его нововведения живы и по сей день. Все действия Петра I во внутренней и внешней политике так или иначе сводились к одному: император стремился увеличить военную и техническую мощь страны, прорубить «окно в Европу» и заимствовать лучшие достижения европейской цивилизации. "
    ),
    "childhood": (
        "Детство и юность\n\n"
        "Дата рождения Петра I – 30 мая (9 июня) 1672 года. Петр был старшим сыном царя Алексея Михайловича от второй жены, Натальи Кирилловны Нарышкиной. Воспитывали наследника престола няньки, а грамоте обучал не слишком образованный дьяк Никита Зотов. Петр I не получил систематического европейского образования, поздно освоил грамоту и писал с ошибками. Впрочем, юный царевич всегда отличался тягой к знаниям и всю жизнь учился новому. Он с удовольствием осваивал ремесла и говорил на нескольких иностранных языках.\n\n"
        "Уже в раннем детстве проявилась у царевича и тяга к военной науке. Для игр Петра был сформирован «потешный» полк из сверстников будущего императора. Петр со своими соратниками устраивал показательные сражения, штурмовал крепости и даже завел при своих потешных артиллерию. Постепенно «игра в солдатики» перешла в настоящее военно-практическое обучение, а в число потешных стали записываться и взрослые люди. Из детских игр царевича выросла впоследствии знаменитая петровская армия нового строя, а сами потешные стали ее элитными гвардейскими частями – Преображенским и Семеновским полками."
    ),
    "reforms": (
        "Радикальные преобразования петровского времени коснулись всех сфер русской действительности. Среди основных можно назвать военную, административную, финансовую и церковную реформы.\n\n"
        "Военные реформы"
        ". "
        "Роспуск стрелецкого войска и создание армии «нового строя», то есть регулярной армии, организованной по европейскому образцу, стали первым этапом масштабных военных реформ. За пару десятилетий Петр «с нуля», а иногда и собственноручно (вспомним его учебу на верфях Саардама и Дептфорда) построил флот со всей его инфраструктурой – верфями, адмиралтействами, лесозаготовительными предприятиями."
        "Постепенно большую часть иностранцев на воинской службе заменили хорошо обученные русские офицеры. Изменился и способ комплектования армии. В 1705 году Петром I была введена рекрутская повинность, которой подлежали все сословия. Для дворян это была повинность личная, для податных сословий – общинная. Рекрут уходил из родного дома навсегда: срок его службы при Петре был пожизненным.\n\n"
        "Реформы государственного управления"
        ". "
        "Четкого плана реформ государственного управления у Петра Великого не было. Монарх стремился к уменьшению влияния Боярской думы и к созданию эффективной административной вертикали. В 1711 году Петр создал Правительствующий Сенат – высший орган коллегиального управления страной «вместо его царского величества собственной персоны» на то время, пока неугомонный русский царь находился в отлучке. Постепенно Сенат приобрел законосовещательные, административные и судебные функции."
        "Запутанная система приказов к началу XVIII века полностью изжила себя, и Петр постепенно избавлялся от нее. Новые органы управления – коллегии – должны были четко распределить между собой функции прежних ведомств, сделать административную систему прозрачной и ускорить ее работу. Число коллегий менялось, главными считались Военная, Адмиралтейская и Иностранных дел. Для контроля над деятельностью разросшегося бюрократического аппарата при Петре создаются прокуратура и институт фискалов.\n\n"
        "Церковная реформа"
        ". "
        "Петр с его стремлением подчинить все сферы жизни нуждам государства, не мог смириться с независимостью церкви. Он упразднил патриаршество и соборность церкви, а орган управления ею превратил, по сути, в одну из коллегий – Святейший правительствующий Синод (1721). Таким образом, церковь полностью встраивалась во властную иерархию с самодержавным царем во главе.\n\n"
        "Денежная реформа"
        ". "
        "Поиск средств на ведение войны постоянно занимал Петра. В первые годы его царствования казна была практически опустошена, и царь выдумывал новые и новые способы ее наполнить: вводились прямые и косвенные налоги, требовалось обязательное использование гербовой бумаги, уменьшался вес монет. Основной денежной единицей при Петре стала не прежняя деньга, а копейка."
        "Серьезную перестройку финансовой системы страны вызвал переход к новому способу налогообложения – подушной (а не подворной, как раньше) подати. Это потребовало проведения регулярных переписей населения, поскольку необходимая для содержания армии, флота и администрации сумма делилась теперь не по числу хозяйств (крестьянских дворов), а по числу душ мужского пола. Несмотря на недоборы и неточность переписей, эта реформа увеличила размер казны как минимум вдвое.\n\n"
        "Реформа образования"
        ". "
        "Царь-реформатор был, несомненно, и царем-просветителем. Он отправлял молодежь учиться за границу, приглашал в Россию европейских профессоров и технических специалистов, открывал учебные заведения для подготовки военных и морских кадров, инженеров, врачей. С 1701 по 1721 годы в России начали работу школа математических и навигацких наук, артиллерийская, медицинская, инженерная школы и морская академия."
        "Не забывал Петр и о массовом образовании, своими указами поощряя открытие «цифирных школ» для обучения детей грамоте и счету. Для дворянства и духовного сословия получение образования стало при Петре обязательным. Царь развивал книгоиздание, провел реформу типографского шрифта, начал выпуск первой в России газеты. Не ограничиваясь школами, готовившими специалистов-практиков, Петр задался целью создать такой научный центр, который бы ничем не уступал знаменитым европейским академиям. Так родился проект создания Академии наук, при которой находились бы университет и гимназия. Открытие Академии состоялось спустя год после смерти Петра I."

    ),
    "military": (
        "Великая Северная война 1700-1721\n\n"
        "К началу XVIII столетия внешняя политика Петра обращается к Европе – царь решает вернуть земли на Балтике. Воевать в одиночку и на два фронта Россия не могла, поэтому Северная война началась лишь после того, как было заключено перемирие с Османской империей и сформирован «Северный союз» – антишведская коалиция России, Дании, Саксонии и Речи Посполитой. "
        "Начало Северной войны оказалось для нашей страны тяжелым. После разгрома русских войск при Нарве 19 (30) ноября 1700 года стало очевидно, насколько катастрофическим было отставание России в военной, промышленной и экономической сфере.\n\n"
        "Пётр I полностью реорганизовал управление армией, изменил систему снабжения, поставил на службу армии промышленность, построил верфи и флот. Результат не заставил себя ждать: уже спустя два-три года русские вышли на побережье Балтийского моря в устье Невы, захватив крепости Нотебург и Ниеншанц и начав строительство Санкт-Петербурга. К 1704 году Петр овладел Нарвой и Дерптом, а 27 июня (8 июля) 1709 года наголову разгромил шведского короля Карла XII в Полтавской баталии. Среди крупнейших побед молодого российского флота – битвы при Гангуте 1714 года и при Гренгаме 1720 года. Мир со Швецией был подписан 30 августа (10 сентября) 1721 года в Ништадте. Россия закрепила за собой обширные прибалтийские территории (Ингрию, Карелию, Эстляндию и Лифляндию) и овладела выходом к морю.\n\n"
        "Русско-турецкая война 1710–1713 гг.\n\n"
        "В 1710 году султан объявил войну России, и Петру пришлось воевать на два фронта. Государь лично повел войска в сторону Дуная, где надеялся получить поддержку подвластных Турции христиан. Этот поход 1711 года окончился для России плачевно. Армия была окружена при реке Прут. Солдаты жестоко страдали от жажды и голода, самому царю и его окружению грозил плен – пришлось просить у турок мира."
        "Прутский мирный договор с Османской империей, а затем и Адрианопольский мир 1713 года позволили Петру продолжить борьбу со Швецией, но отняли у него все прежние южные завоевания. Азов вернули Турции, Таганрог разрушили, Россия потеряла Азовский флот и выход к морю. Впрочем, эти условия были гораздо мягче тех, на которые был изначально согласен Петр, отчаянно метавшийся в прутской западне.\n\n"
        "Продвижение на восток\n\n"
        "Несмотря на непрекращающиеся войны в европейской части России, Петр Великий продолжал освоение и восточных земель – Сибири, Средней Азии, Дальнего Востока. Сподвижник государя И.Д. Бухгольц отправился в экспедицию в Сибирь в 1714 году и основал к югу от Иртыша Омскую крепость. В 1716–1717 гг. в Хивинское ханство был послан с крупным отрядом князь А. Бекович-Черкасский. Он должен был склонить к подданству хивинского хана, разведать, нельзя ли добывать в Амударье золото, и даже проложить путь в Индию. Поход Бековича окончился неудачей: все его солдаты погибли или попали в плен, был убит и сам предводитель."
        "При Петре продолжалось активное освоение Дальнего Востока, в том числе Камчатки. С 1708 года полуостров вошел в состав Якутского уезда Сибирской губернии. Именно с подачи императора уже после его смерти были организованы экспедиции Витуса Беринга в Америку через Тихий океан.\n\n"
        "Каспийский (Персидский) поход\n\n"
        "В 1722–1723 гг. Россия под властью императора Петра вступила в новую войну – с Персией. Целью Персидского (Каспийского) похода было овладение территориями юго-восточного Закавказья и Дагестана. В 1722 году русской армии и флоту сдался Дербент, а в 1723 году подчинился западный берег Каспийского моря, в том числе крепость Баку. Вмешательство Османской империи остановило дальнейшие завоевания, а спустя несколько лет после кончины Петра прикаспийские земли были возвращены Персии."
    ),
    "cultural": (
        "Культурное наследие\n\n"
        "Пётр I активно поддерживал науку и культуру, создавая Академию наук и привлекая иностранных специалистов. "
        "Его реформы способствовали культурному обмену и обновлению российского общества."
    ),
    "legacy": (
        "Наследие\n\n"
        "Реформы Петра I заложили основы превращения России в современное государство. Его правление оказало долговременное влияние на все сферы жизни, "
        "от военного дела до культуры и управления."
    )
}

#образец 1.0
# import telebot
# from telebot import types
# from lists_petr1 import bio_sections
# bot = telebot.TeleBot('7861387718:AAHB5vmw90lDXi5v4hbyjSWcu1zjkonn-Xg')
# from telebot import types
#
# messages = {}
# pages = {}
#
# def get_biography_menu():
#     markup = types.InlineKeyboardMarkup(row_width=2)
#     btn_overview = types.InlineKeyboardButton("Общий обзор", callback_data="overview")
#     btn_childhood = types.InlineKeyboardButton("Детство и юность", callback_data="childhood")
#     btn_reforms = types.InlineKeyboardButton("Реформы", callback_data="reforms")
#     btn_military = types.InlineKeyboardButton("Военные кампании", callback_data="military")
#     # btn_cultural = types.InlineKeyboardButton("Культура", callback_data="cultural")
#     # btn_legacy = types.InlineKeyboardButton("Наследие", callback_data="legacy")
#     markup.add(btn_overview, btn_childhood, btn_reforms, btn_military)
#     return markup
#
# def get_back_button():
#     markup = types.InlineKeyboardMarkup()
#     btn_back = types.InlineKeyboardButton("Назад в меню", callback_data="back_to_menu")
#     markup.add(btn_back)
#     return markup
#
#
# def create_navigation_buttons(current_page, total_pages, section):
#     markup = types.InlineKeyboardMarkup()
#     if current_page > 0:
#         btn_prev = types.InlineKeyboardButton("Предыдущая страница", callback_data=f"previous_{section}_{current_page}")
#         markup.add(btn_prev)
#     if current_page < total_pages - 1:
#         btn_next = types.InlineKeyboardButton("Следущая страница", callback_data=f"next_{section}_{current_page}")
#         markup.add(btn_next)
#     btn_back = types.InlineKeyboardButton("Вернуться в меню", callback_data="back_to_menu")
#     markup.add(btn_back)
#     return markup
#
# @bot.message_handler(commands=["start"])
# def start_command(message):
#     text = (
#         "Привет! Я бот, который расскажет тебе подробную биографию Петра I.\n\n"
#         "Выбери интересующий раздел, нажав одну из кнопок ниже."
#     )
#     msg = bot.send_message(message.chat.id, text, reply_markup=get_biography_menu())
#     messages[message.chat.id] = [msg]
#
# @bot.callback_query_handler(func=lambda call: True)
# def handle_callback_query(call):
#     chat_id = call.message.chat.id
#
#     if call.data in bio_sections:
#         for mas in messages.get(chat_id, []):
#             try:
#                 bot.delete_message(chat_id, mas.id)
#             except Exception as e:
#                 print(f"Не удалось удалить сообщение: {e}")
#
#         messages[chat_id] = []
#         text = bio_sections[call.data]
#         pages[chat_id] = text.split('\n\n')
#         current_page = 0
#         total_pages = len(pages[chat_id])
#
#         msg_text = pages[chat_id][current_page]
#         msg = bot.send_message(chat_id, msg_text, reply_markup=create_navigation_buttons(current_page, total_pages, call.data))
#         messages[chat_id].append(msg)
#
#     elif call.data.startswith('next_') or call.data.startswith('previous_'):
#         _, section, current_page = call.data.split('_')
#         current_page = int(current_page)
#
#         if call.data.startswith('next_'):
#             current_page += 1
#         else:
#             current_page -= 1
#
#         for msg in messages.get(chat_id, []):
#             try:
#                 bot.delete_message(chat_id, msg.id)
#             except Exception as e:
#                 print(f"Не удалось удалить сообщение: {e}")
#
#         messages[chat_id] = []
#
#         msg_text = pages[chat_id][current_page]
#         total_pages = len(pages[chat_id])
#         msg = bot.send_message(chat_id, msg_text, reply_markup=create_navigation_buttons(current_page, total_pages, section))
#         messages[chat_id].append(msg)
#
#     elif call.data == "back_to_menu":
#         for mas in messages.get(chat_id, []):
#             try:
#                 bot.delete_message(chat_id, mas.id)
#             except Exception as e:
#                 print(f"Не удалось удалить сообщение: {e}")
#
#         messages[chat_id] = []
#         mas = bot.send_message(chat_id, "Возвращаемся в главное меню...")
#         messages[chat_id].append(mas)
#
#         mas = bot.send_message(chat_id, "Выбери интересующий раздел, нажав одну из кнопок ниже.",
#                                reply_markup=get_biography_menu())
#         messages[chat_id].append(mas)
#
#
#
# if __name__ == '__main__':
#     bot.polling(none_stop=True)
